{
  "framework": "The P.E.R.F.O.R.M. Strategy",
  "description": "A framework for structuring high-converting ads by leveraging human motivation and psychological triggers.",
  "steps": [
    {
      "letter": "P",
      "component": "Problem (hook)",
      "description": "Immediately call out a problem your audience already feels. This targets the 'Pain Avoidance' buying driver.",
      "examples": {
        "Med Spa": "Ladies! Sick of crows feet?",
        "Gym": "Do you find commercial gyms intimidating? We do too!",
        "Roofing": "Is your roof damaged after the storm?",
        "OsteoStrong": "Tired of managing your osteoporosis instead of improving it?"
      }
    },
    {
      "letter": "E",
      "component": "Explanation (your solution)",
      "description": "Explain how you solve the problem in as few words as possible. Does not need to be the full solution, just 'scratch the itch'.",
      "examples": {
        "Weight Loss Clinic": "20lb of weight lost in under 6 weeks guaranteed with this revolutionary system.",
        "Remodelling": "Get 3 design concepts for your dream bathroom that are guaranteed to fit into your budget [delivered within 2 hours]."
      }
    },
    {
      "letter": "R",
      "component": "Result (transformation)",
      "description": "Show them what life will be like after using the product. Targets 'Hope and Transformation'.",
      "examples": {
        "Gym": "Imagine enjoying food again without worrying about gaining weight!",
        "Landscaping": "Have the best driveway on your road GUARANTEED!",
        "OsteoStrong": "A stronger, more confident you... scientifically proven to increase bone density."
      }
    },
    {
      "letter": "F",
      "component": "Friction (objections)",
      "description": "Address the top 1-3 reasons they might not buy to reduce perceived risk.",
      "examples": {
        "Landscaping": "Free design consultation. No upfront payment. 10-year workmanship warranty.",
        "Gym": "No long-term contracts. All fitness levels welcome. Money-back guarantee.",
        "Med Spa": "Clinically proven treatments. Licensed professionals. Free skin consultation."
      }
    },
    {
      "letter": "O",
      "component": "Others (proof)",
      "description": "Show social proof that it works for people like them. People trust what others approve of.",
      "examples": {
        "Landscaping": "Over 200 driveways installed locally — 5-star Google rating.",
        "Gym": "Over 1,000 lbs lost by members in the last 12 months.",
        "Med Spa": "Voted #1 Med Spa in [City], 300+ 5-star reviews."
      }
    },
    {
      "letter": "R",
      "component": "Request (CTA)",
      "description": "Tell the user exactly what to do next. Sell the 'first step' rather than the core product.",
      "examples": {
        "Landscaping": "Book in your free driveway estimate.",
        "Gym": "Claim your free personal training session.",
        "Med Spa": "Book your complimentary skin assessment."
      }
    },
    {
      "letter": "M",
      "component": "Motive (urgency / incentive)",
      "description": "Provide a reason to act immediately. Use 'ethical bribes' or justified scarcity.",
      "examples": {
        "Windows": "Free Anthracite Grey Upgrade Worth £750 - Over order! Only 25 frames available for free upgrade!",
        "Driveways": "Get 3 free 3D designs of your dream driveway that fit your budget.",
        "OsteoStrong": "We only have [15] slots available for complimentary sessions this month."
      }
    }
  ],
  "core_principles": [
    "People purchase with emotion and justify with logic",
    "Ads should focus on the next step in the funnel, not the final sale",
    "Scarcity and urgency must be justified to be effective",
    "Authority and reciprocity (giving value first) boost conversion rates"
  ]
}